avrdudes/avr-libc/include/avr/ioavr16la20.h
/*
--------------------------------------------------------------------------
AC - Analog Comparator
--------------------------------------------------------------------------
*/

/* Analog Comparator */
typedef struct AC_struct
{
    register8_t CTRLA;  /* Control A */
    register8_t CTRLB;  /* Control B */
    register8_t MUXCTRL;  /* Multiplexer Control */
    register8_t REFSCALE;  /* Reference Scaling */
    register8_t INTCTRL;  /* Interrupt Control */
    register8_t INTFLAGS;  /* Interrupt Flags */
    register8_t STATUS;  /* Status */
    register8_t reserved_1[1];
} AC_t;

/* Analog Comparator State select bit group values */
typedef enum AC_CMP_VALUES_enum
{
    AC_CMP_LOW_gv                  = 0x00,  /* Comparator output is low */
    AC_CMP_HIGH_gv                 = 0x01   /* Comparator output is high */
} AC_CMP_values_t;

/* Analog Comparator State select bit group configurations*/
typedef enum AC_CMP_enum
{
    AC_CMP_LOW_gc                  = (AC_CMP_LOW_gv << AC_CMP_bp),  /* Comparator output is low */
    AC_CMP_HIGH_gc                 = (AC_CMP_HIGH_gv << AC_CMP_bp)   /* Comparator output is high */
} AC_CMP_t;

/* Hysteresis Mode Select bit group values */
typedef enum AC_HYSMODE_VALUES_enum
{
    AC_HYSMODE_NONE_gv             = 0x00,  /* No hysteresis */
    AC_HYSMODE_SMALL_gv            = 0x01,  /* Small hysteresis */
    AC_HYSMODE_MEDIUM_gv           = 0x02,  /* Medium hysteresis */
    AC_HYSMODE_LARGE_gv            = 0x03   /* Large hysteresis */
} AC_HYSMODE_values_t;

/* Hysteresis Mode Select bit group configurations*/
typedef enum AC_HYSMODE_enum
{
    AC_HYSMODE_NONE_gc             = (AC_HYSMODE_NONE_gv << AC_HYSMODE_gp),  /* No hysteresis */
    AC_HYSMODE_SMALL_gc            = (AC_HYSMODE_SMALL_gv << AC_HYSMODE_gp),  /* Small hysteresis */
    AC_HYSMODE_MEDIUM_gc           = (AC_HYSMODE_MEDIUM_gv << AC_HYSMODE_gp),  /* Medium hysteresis */
    AC_HYSMODE_LARGE_gc            = (AC_HYSMODE_LARGE_gv << AC_HYSMODE_gp)   /* Large hysteresis */
} AC_HYSMODE_t;

/* Output initial value select bit group values */
typedef enum AC_INITVAL_VALUES_enum
{
    AC_INITVAL_LOW_gv              = 0x00,  /* Output initialized to 0 */
    AC_INITVAL_HIGH_gv             = 0x01   /* Output initialized to 1 */
} AC_INITVAL_values_t;

/* Output initial value select bit group configurations*/
typedef enum AC_INITVAL_enum
{
    AC_INITVAL_LOW_gc              = (AC_INITVAL_LOW_gv << AC_INITVAL_bp),  /* Output initialized to 0 */
    AC_INITVAL_HIGH_gc             = (AC_INITVAL_HIGH_gv << AC_INITVAL_bp)   /* Output initialized to 1 */
} AC_INITVAL_t;

/* Interrupt Mode select bit group values */
typedef enum AC_INTMODE_VALUES_enum
{
    AC_INTMODE_BOTHEDGE_gv         = 0x00,  /* Positive and negative inputs crosses */
    AC_INTMODE_NEGEDGE_gv          = 0x02,  /* Positive input goes below negative input */
    AC_INTMODE_POSEDGE_gv          = 0x03   /* Positive input goes above negative input */
} AC_INTMODE_values_t;

/* Interrupt Mode select bit group configurations*/
typedef enum AC_INTMODE_enum
{
    AC_INTMODE_BOTHEDGE_gc         = (AC_INTMODE_BOTHEDGE_gv << AC_INTMODE_gp),  /* Positive and negative inputs crosses */
    AC_INTMODE_NEGEDGE_gc          = (AC_INTMODE_NEGEDGE_gv << AC_INTMODE_gp),  /* Positive input goes below negative input */
    AC_INTMODE_POSEDGE_gc          = (AC_INTMODE_POSEDGE_gv << AC_INTMODE_gp)   /* Positive input goes above negative input */
} AC_INTMODE_t;

/* Negative Input MUX Selection bit group values */
typedef enum AC_MUXNEG_VALUES_enum
{
    AC_MUXNEG_AINN0_gv             = 0x00,  /* Negative Pin 0 */
    AC_MUXNEG_AINN1_gv             = 0x01,  /* Negative Pin 1 */
    AC_MUXNEG_AINN2_gv             = 0x02,  /* Negative Pin 2 */
    AC_MUXNEG_REFSCALE_gv          = 0x04   /* Reference Scaler */
} AC_MUXNEG_values_t;

/* Negative Input MUX Selection bit group configurations*/
typedef enum AC_MUXNEG_enum
{
    AC_MUXNEG_AINN0_gc             = (AC_MUXNEG_AINN0_gv << AC_MUXNEG_gp),  /* Negative Pin 0 */
    AC_MUXNEG_AINN1_gc             = (AC_MUXNEG_AINN1_gv << AC_MUXNEG_gp),  /* Negative Pin 1 */
    AC_MUXNEG_AINN2_gc             = (AC_MUXNEG_AINN2_gv << AC_MUXNEG_gp),  /* Negative Pin 2 */
    AC_MUXNEG_REFSCALE_gc          = (AC_MUXNEG_REFSCALE_gv << AC_MUXNEG_gp)   /* Reference Scaler */
} AC_MUXNEG_t;

/* Positive Input MUX Selection bit group values */
typedef enum AC_MUXPOS_VALUES_enum
{
    AC_MUXPOS_AINP0_gv             = 0x00,  /* Positive Pin 0 */
    AC_MUXPOS_AINP3_gv             = 0x03,  /* Positive Pin 3 */
    AC_MUXPOS_VDDDIV10_gv          = 0x07   /* VDD divided by 10 */
} AC_MUXPOS_values_t;

/* Positive Input MUX Selection bit group configurations*/
typedef enum AC_MUXPOS_enum
{
    AC_MUXPOS_AINP0_gc             = (AC_MUXPOS_AINP0_gv << AC_MUXPOS_gp),  /* Positive Pin 0 */
    AC_MUXPOS_AINP3_gc             = (AC_MUXPOS_AINP3_gv << AC_MUXPOS_gp),  /* Positive Pin 3 */
    AC_MUXPOS_VDDDIV10_gc          = (AC_MUXPOS_VDDDIV10_gv << AC_MUXPOS_gp)   /* VDD divided by 10 */
} AC_MUXPOS_t;

/* Operation Select bit group values */
typedef enum AC_OPSEL_VALUES_enum
{
    AC_OPSEL_CONT_gv               = 0x00,  /* Continuous mode */
    AC_OPSEL_EVENT_gv              = 0x01,  /* Event triggered mode */
    AC_OPSEL_SAMP1K_gv             = 0x02,  /* Sampled mode, 1 kHz sampling frequency */
    AC_OPSEL_SAMP128_gv            = 0x03   /* Sampled mode, 128 Hz sampling frequency */
} AC_OPSEL_values_t;

/* Operation Select bit group configurations*/
typedef enum AC_OPSEL_enum
{
    AC_OPSEL_CONT_gc               = (AC_OPSEL_CONT_gv << AC_OPSEL_gp),  /* Continuous mode */
    AC_OPSEL_EVENT_gc              = (AC_OPSEL_EVENT_gv << AC_OPSEL_gp),  /* Event triggered mode */
    AC_OPSEL_SAMP1K_gc             = (AC_OPSEL_SAMP1K_gv << AC_OPSEL_gp),  /* Sampled mode, 1 kHz sampling frequency */
    AC_OPSEL_SAMP128_gc            = (AC_OPSEL_SAMP128_gv << AC_OPSEL_gp)   /* Sampled mode, 128 Hz sampling frequency */
} AC_OPSEL_t;

/*
--------------------------------------------------------------------------
ADC - Analog to Digital Converter
--------------------------------------------------------------------------
*/

/* Analog to Digital Converter */
typedef struct ADC_struct
{
    register8_t CTRLA;  /* Control A */
    register8_t CTRLB;  /* Control B */
    register8_t CTRLC;  /* Control C */
    register8_t CTRLD;  /* Control D */
    register8_t CTRLE;  /* Control E */
    register8_t CTRLF;  /* Control F */
    register8_t INTCTRL;  /* Interrupt Control */
    register8_t INTFLAGS;  /* Interrupt Flags */
    register8_t STATUS;  /* Status */
    register8_t DBGCTRL;  /* Debug Control */
    register8_t COMMAND;  /* Command */
    register8_t MUXPOS;  /* Positive Input Multiplexer */
    _WORDREGISTER(RESULT);  /* Result */
    _WORDREGISTER(SAMPLE);  /* Sample */
    _WORDREGISTER(WINLT);  /* Window Low Threshold */
    _WORDREGISTER(WINHT);  /* Window High Threshold */
    register8_t TEMP;  /* Temporary */
    register8_t reserved_1[43];
} ADC_t;

/* Mode select bit group values */
typedef enum ADC_MODE_VALUES_enum
{
    ADC_MODE_SINGLE_8BIT_gv        = 0x00,  /* Single Conversion with 8-bit resolution */
    ADC_MODE_SINGLE_10BIT_gv       = 0x01,  /* Single Conversion with 10-bit resolution */
    ADC_MODE_SERIES_gv             = 0x02,  /* Series with accumulation, separate trigger for every 10-bit conversion */
    ADC_MODE_BURST_gv              = 0x03,  /* Burst with accumulation, one trigger will run SAMPNUM 10-bit conversions in one sequence */
    ADC_MODE_ACCTEST_gv            = 0x07   /* Accumulator diagnostic mode */
} ADC_MODE_values_t;

/* Mode select bit group configurations*/
typedef enum ADC_MODE_enum
{
    ADC_MODE_SINGLE_8BIT_gc        = (ADC_MODE_SINGLE_8BIT_gv << ADC_MODE_gp),  /* Single Conversion with 8-bit resolution */
    ADC_MODE_SINGLE_10BIT_gc       = (ADC_MODE_SINGLE_10BIT_gv << ADC_MODE_gp),  /* Single Conversion with 10-bit resolution */
    ADC_MODE_SERIES_gc             = (ADC_MODE_SERIES_gv << ADC_MODE_gp),  /* Series with accumulation, separate trigger for every 10-bit conversion */
    ADC_MODE_BURST_gc              = (ADC_MODE_BURST_gv << ADC_MODE_gp),  /* Burst with accumulation, one trigger will run SAMPNUM 10-bit conversions in one sequence */
    ADC_MODE_ACCTEST_gc            = (ADC_MODE_ACCTEST_gv << ADC_MODE_gp)   /* Accumulator diagnostic mode */
} ADC_MODE_t;

/* Positive Input Multiplexer select bit group values */
typedef enum ADC_MUXPOS_VALUES_enum
{
    ADC_MUXPOS_AIN4_gv             = 0x04,  /* ADC input pin 4 */
    ADC_MUXPOS_AIN5_gv             = 0x05,  /* ADC input pin 5 */
    ADC_MUXPOS_AIN6_gv             = 0x06,  /* ADC input pin 6 */
    ADC_MUXPOS_AIN7_gv             = 0x07,  /* ADC input pin 7 */
    ADC_MUXPOS_AIN22_gv            = 0x16,  /* ADC input pin 22 */
    ADC_MUXPOS_AIN23_gv            = 0x17,  /* ADC input pin 23 */
    ADC_MUXPOS_AIN24_gv            = 0x18,  /* ADC input pin 24 */
    ADC_MUXPOS_AIN25_gv            = 0x19,  /* ADC input pin 25 */
    ADC_MUXPOS_AIN26_gv            = 0x1A,  /* ADC input pin 26 */
    ADC_MUXPOS_AIN27_gv            = 0x1B,  /* ADC input pin 27 */
    ADC_MUXPOS_TEMPSENSE_gv        = 0x29,  /* Temperature Sensor */
    ADC_MUXPOS_VDDDIV10_gv         = 0x2A,  /* VDD Divided by 10 */
    ADC_MUXPOS_AC0REFSCALE_gv      = 0x2B,  /* AC0 Reference Scaler */
    ADC_MUXPOS_PTC_gv              = 0x3E   /* Peripheral Touch Controller */
} ADC_MUXPOS_values_t;

